IdeaRS.Connections
AnchoringDataHelper.CreateOrigin Method
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.CreateOrigin(IdeaRS.Connections.IAnchoring,IdeaRS.Connections.Model.IConnectedBeam,IdeaRS.Connections.Model.IPlate)"]
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static IPoint3D CreateOrigin(
	IAnchoring anchoring,
	IConnectedBeam connectedMember,
	IPlate connectedPlate
)
Parameters
anchoring
Type: IAnchoring
[Missing <param name="anchoring"/> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.CreateOrigin(IdeaRS.Connections.IAnchoring,IdeaRS.Connections.Model.IConnectedBeam,IdeaRS.Connections.Model.IPlate)"]
connectedMember
Type: IConnectedBeam
[Missing <param name="connectedMember"/> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.CreateOrigin(IdeaRS.Connections.IAnchoring,IdeaRS.Connections.Model.IConnectedBeam,IdeaRS.Connections.Model.IPlate)"]
connectedPlate
Type: IPlate
[Missing <param name="connectedPlate"/> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.CreateOrigin(IdeaRS.Connections.IAnchoring,IdeaRS.Connections.Model.IConnectedBeam,IdeaRS.Connections.Model.IPlate)"]
Return Value
Type: IPoint3D
[Missing <returns> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.CreateOrigin(IdeaRS.Connections.IAnchoring,IdeaRS.Connections.Model.IConnectedBeam,IdeaRS.Connections.Model.IPlate)"]
See Also
Reference
AnchoringDataHelper Class
IdeaRS.Connections.Data Namespace